README.org
ç
Learning about Natural Language Tool Kit (NLTK) from tests

A first version can be found in: https://github.com/Lingwars/GAPLEN

Thanks to GAPLEN by the shared time.

Learning NLTK from Tests by David Arroyo Menéndez

* Installing from git
#+BEGIN_SRC
$ git clone https://github.com/davidam/damenltk
$ pip3 install nltk scikit-learn
$ cd damenltk
$ python3 damenltk/installing-nltk-modules.py
#+END_SRC

* Check Test
+ Execute all tests:
#+BEGIN_SRC
$ ./runtests.sh
#+END_SRC

+ Execute one file:
#+BEGIN_SRC
$ pytest test/test_bernoulli.py 
#+END_SRC

* Pypi
+ You can install from Internet in a python virtual environment to check: 
#+BEGIN_SRC 
$ python3 -m venv /tmp/dn
$ cd /tmp/dn
$ source bin/activate
$ pip3 install damenltk
$ cd /tmp/dn/lib/python3.14/site-packages/damenltk
$ pytest test/test_bernoulli.py 
#+END_SRC

+ To create new tar.gz in dist directory: 
#+BEGIN_SRC 
$ python3 -m build
#+END_SRC

+ To upload to pypi: 
#+BEGIN_SRC 
$ twine upload dist/damenltk-0.1.tar.gz
#+END_SRC

